package HomeWork1;

/**1.1. http://developer.alexanderklimov.ru/android/java/bitwise.php
1.2 Использовать ВСЕ возможные побитовые операции с числами 42 и 15.
1.3 Использовать ВСЕ возможные побитовые операции с числами -42 и -15.
1.4 В комментариях к каждой операции написать двоичный код каждого числа и результата операции.
1.5 Попробуйте сделать побитовую операцию с числова 42.5*/
public class Task1 {
    public static void main(String[] args) {
        //1.2
        byte a = 42;
        byte b = 15;

        System.out.println(~a);     //~0010 1010
                                    // 1101 0101   -43
        System.out.println(~b);     //~0000 1111
                                    // 1111 0000   -16
        System.out.println(a & b);  // 0010 1010
                                    //&0000 1111
                                    // 0000 1010   10
        System.out.println(a | b);  // 0010 1010
                                    //|0000 1111
                                    // 0010 1111   47
        System.out.println(a ^ b);  // 0010 1010
                                    //^0000 1111
                                    // 0010 0101   37
        System.out.println(a >> 1); //>>0010 1010
                                    //  0001 0101  21
        System.out.println(b >> 1); //>>0000 1111
                                    //  0000 0111  7
        System.out.println(a << 1); //<<0010 1010
                                    //  0101 1010  84
        System.out.println(b << 1); //<<0000 1111
                                    //  0001 1110  30
        System.out.println(a >>>1 );//>>>0010 1010
                                    //   0001 0101 21
        System.out.println(b >>> 1);//>>>0000 1111
                                    //   0000 0111 7

        //1.2
        a = -42;
        b = -15;

        System.out.println(~a);     //~1101 0110
                                    // 0010 1001  41

        System.out.println(~b);     //~1111 0001
                                    // 0000 1110  14

        System.out.println(a & b);  // 1101 0110
                                    //&1111 0001
                                    // 1101 0000  -48

        System.out.println(a | b);  // 1101 0110
                                    //|1111 0001
                                    // 1111 0111  -9

        System.out.println(a ^ b);  // 1101 0110
                                    //^1111 0001
                                    // 0010 0111  39

        System.out.println(a >> 1); //>>1101 0110
                                    //  1110 1011 -21

        System.out.println(b >> 1); //>>1111 0001
                                    //  1111 1000 -8

        System.out.println(a << 1); //<<1101 0110
                                    //  1010 1100 -84

        System.out.println(b << 1); //<<1111 0001
                                    //  1110 0010 -30

        System.out.println(a >>> 1);//>>>1101 0110
                                    //   0110 1011 2_147_483_627
                                    //   (преобразовалось в int, поменяло знак, т.к. первый бит стал 0)

        System.out.println(b >>> 1);//>>>1111 0001
                                    //   0111 1000 2_147_483_640
                                    //   (преобразовалось в int, поменяло знак, т.к. первый бит стал 0)

        //1.4
        //float f = 42.5f;
        //System.out.println(f >> 1);  // побитовые операции применяются к целочисленным типам

    }
}
